app/controllers/emps_controller.rb

SELECT * FROM `emps`
---
 def index

  self.smerf_user_id = 1

    @emps = Emp.all

SELECT * FROM `emps` WHERE (`emps`.`id` = 1)
---
  def show
    @emp = Emp.find(params[:id])

INSERT INTO `emps` (`name`, `updated_at`, `email`, `created_at`) VALUES('chandu', '2011-06-17 09:44:28', 'chandu@gamil.com', '2011-06-17 09:44:28')
---
  def create
    @emp = Emp.new(params[:emp])

    respond_to do |format|
      if @emp.save